---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurves
source: html/c789329f-e7c5-1b38-5809-0c3d865aa62a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.StairNotEnoughBoundaryCurves Property

Stairs require boundaries (chains of one or more Boundary Lines) on each side of the Stair.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairNotEnoughBoundaryCurves { get; }
```